{
    "projects": [{
            "title": "SolarSim",
            "description": "A physically accurate orbital simulation of a planetary system, with a single star and any number of planets. I worked on the JavaScript code for simulating the physics, and also did the animation using HTML5 Canvas, which was also used to create the animation for my website! This project was made for the Nasa Space Apps Challenge, a space-themed hackathon, with my friends Giancarlo Pernudi, Dylan Hanna, and Jawad Rizvi.",
            "thumbnail_url": "data/images/thumbnail/solarsim.png",
            "source_url": "https://github.com/ualberta-spacebar/SolarSim",
            "demo_url": "https://ualberta-spacebar.github.io/SolarSim/",
            "tags": [
                "JavaScript",
                "Canvas",
                "Simulation"
            ]
        },
        {
            "title": "Are you smarter than an AI?",
            "description": "Compare your accuracy in diagnosing Skin Cancer to a trained image classification model. This was made as a demo for our club (the Undergraduate AI Society) for an AI in Medicine symposium. We took a pre-trained resnet50 model and fine-tuned it on a skin cancer dataset, then I wrote the web app to allow users to compete against it. We used fast.ai as our deep learning library of choice, and Flask for the web app. Made in collaboration with Peter Friedrich and Giancarlo Pernudi.",
            "thumbnail_url": "data/images/thumbnail/skin_cancer.png",
            "source_url": "https://github.com/UndergraduateArtificialIntelligenceClub/skin_cancer",
            "demo_url": "https://willfenton.dev/skincancer",
            "tags": [
                "Python",
                "Machine Learning",
                "Flask",
                "JavaScript",
                "fast.ai"
            ]
        },
        {
            "title": "World Generator",
            "description": "A procedural terrain generator I built. It first generates a world using noise algorithms like Perlin noise, then renders them in 3D using Three.js. This project was a learning experience, and I learned a lot about world generation, 3D graphics, as well as web applications like Node, Typescript, and Parcel.js. This is still a work-in-progress, it looks nice but I want to improve the world generation.",
            "thumbnail_url": "data/images/thumbnail/world-generator.png",
            "source_url": "https://github.com/willfenton/world-generator",
            "demo_url": "https://willfenton.github.io/world-generator/",
            "tags": [
                "TypeScript",
                "3D Graphics",
                "Procedual Content Generation",
                "Parcel.js"
            ]
        },
        {
            "title": "Top Album Collage",
            "description": "A visualization of my most listened to albums. This is V2, I had previously built this using Python / PyQT but any time I wanted to see my up to date listening data I had to re-run the script to generate a new collage. It's now web-based, and it updates automatically. I've also added some additional data visible by clicking on the albums.",
            "thumbnail_url": "data/images/thumbnail/lastfmcollage-4x4.jpg",
            "source_url": "https://github.com/willfenton/web-last.fm-album-collage",
            "demo_url": "https://willfenton.dev/music",
            "tags": [
                "JavaScript",
                "Python",
                "Last.fm",
                "Data Visualization"
            ]
        },
        {
            "title": "Identicon Generator",
            "description": "Given a string, such as a username, generates a unique icon (Identicon), which can be used as a profile image. The default profile images on GitHub are an example of Identicons. To generate an Identicon, we first compute the hash of the string and, using that hash, deterministically generate a list of coordinates and associated colours. Then we use the nearest neighbors algorithm to assign each pixel the colour of the point closest to it, resulting in an image like the one shown here, the Identicon for \"willfenton\". Written in Python. This project was made in an afternoon, with my friend Giancarlo Pernudi.",
            "thumbnail_url": "data/images/thumbnail/identicon.png",
            "source_url": "https://github.com/willfenton/Identicon",
            "demo_url": "https://willfenton.dev/identicon",
            "tags": [
                "Python",
                "PIL",
                "Flask"
            ]
        },
        {
            "title": "Function Visualizer",
            "description": "A function graphing tool made using JavaScript and HTML5 Canvas. It works by sampling points along the X-axis and plotting them on the canvas. Currently supports multiple 2D functions, dragging, and zooming, with 3D function support planned for the future. Made in collaboration with Giancarlo Pernudi.",

            "thumbnail_url": "data/images/thumbnail/functionvisualizer.png",
            "source_url": "https://github.com/willfenton/FunctionVisualizer",
            "demo_url": "https://willfenton.github.io/FunctionVisualizer/2D/",
            "tags": [
                "JavaScript",
                "Canvas"
            ]
        },
        {
            "title": "MovieGuru",
            "description": "Have you ever had trouble deciding on a movie to watch, and wanted a way to easily compare them side by side? Well look no further, MovieGuru does exactly that! Enter a list of movies, and out comes all the metrics you could every want to make your decision. I wrote most of the JavaScript for the app. Placed third in the LevelUp hackathon.",
            "thumbnail_url": "data/images/thumbnail/movieguru.png",
            "source_url": "https://github.com/willfenton/MovieGuru",
            "demo_url": "https://willfenton.github.io/MovieGuru/",
            "tags": [
                "JavaScript",
                "Python"
            ]
        },
        {
            "title": "BetaStar",
            "description": "A bot for the game StarCraft II, written in C++ using the SC2 API. The clear successor to DeepMind's AlphaStar, BetaStar is a Protoss bot, and employs a brutal Stalker rush with perfect Blink micro to overwhelm the enemy. BetaStar placed first out of 9 bots in a round robin tournament! Made for a project in my games programming course.",
            "thumbnail_url": "data/images/thumbnail/betastar.png",
            "source_url": "https://github.com/willfenton/BetaStar",
            "video_url": "https://youtu.be/4AHjDSnfI4Q",
            "tags": [
                "C++",
                "AI",
                "StarCraft II"
            ]
        },
        {
            "title": "Canadian Armed Forces in WW1",
            "description": "An interactive data visualization of the Canadian war effort in the First World War. We used a dataset that contained a list of soldiers, their date of death, and burial location, transformed it to a geojson file, and then plotted it on a map. Users can scroll for every month and see the deadliest battles each month. Made in collaboration with Giancarlo Pernudi.",
            "thumbnail_url": "data/images/thumbnail/ww1-cafmap.png",
            "source_url": "https://github.com/giancarlopernudisegura/ww1-cafmap",
            "demo_url": "https://giancarlopernudisegura.github.io/ww1-cafmap/",
            "tags": [
                "JavaScript",
                "Python",
                "Data Visualization"
            ]
        },
        {
            "title": "InfiniMood",
            "description": "An Android app for tracking your mood and emotions over time. Attach locations and images to your moods, and follow your friends to see their recent mood events. Written in Java, and using Google Firestore for our cloud database. Made as a project in my Software Engineering course.",
            "thumbnail_url": "data/images/thumbnail/infinimood.jpg",
            "source_url": "https://github.com/CMPUT301F19T05/InfiniMood",
            "tags": [
                "Java",
                "Android",
                "Firestore"
            ]
        },
        {
            "title": "Tic Tac Toe",
            "description": "A simple command line Tic Tac Toe game I wrote to practice C++ as I was learning it. Play against a human, random player, or unbeatable Minimax algorithm. ",
            "thumbnail_url": "data/images/thumbnail/tictactoe.png",
            "source_url": "https://github.com/willfenton/TicTacToe",
            "tags": [
                "C++"
            ]
        }
    ]
}
